#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
dev relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/platform-stack/platform-stack/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/platform-stack/platform-stack

To view this run in a browser, visit:
https://app.terraform.io/app/platform-stack/platform-dev/runs/run-dk1Q8aaK7EqQaatE

Waiting for the plan to start...

Terraform v1.2.6
on linux_amd64
Initializing plugins and modules...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-06e902e12267c5529]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0b9fd484dfb5c510d]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-090d9da251f5f3471]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08053d1f588da1754]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-08cfd6d6821a47978]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-047d168fc8aa4c331]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-021c42531e7e87883]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e8a975ca98716b75]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-00dff5ae8ae412397]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-031cd0260d383f19f]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0f87fc96024e79bdd]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08606307e01521ce2]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-047d168fc8aa4c3311080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-03fc8f1e0ceed0a6e]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-031e15026f3403be6]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-032ee20ac868914f2]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-087890f9b30120e5d]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ebb411d63116487d]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-02d0fd3426b87b1cf]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.vpc.aws_internet_gateway.this[0] has been deleted
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-east-1:789248412670:internet-gateway/igw-08cfd6d6821a47978" -> null
      - id       = "igw-08cfd6d6821a47978" -> null
        tags     = {
            "Name"      = "shiphero-dev2"
            "Namespace" = "shiphero"
            "Stage"     = "dev2"
            "Terraform" = "true"
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route.public_internet_gateway[0] has been deleted
  - resource "aws_route" "public_internet_gateway" {
      - id                     = "r-rtb-047d168fc8aa4c3311080289494" -> null
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table.private[0] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:789248412670:route-table/rtb-08606307e01521ce2" -> null
      - id               = "rtb-08606307e01521ce2" -> null
      - owner_id         = "789248412670" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-07bf0337480cdc1eb"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.20.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0d0cc652e00708e07"
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "172.30.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0f32c605654aca470"
            },
        ] -> null
      - tags             = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1a"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - tags_all         = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1a"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - vpc_id           = "vpc-06e902e12267c5529" -> null

      - timeouts {}
    }

  # module.vpc.aws_route_table.private[1] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:789248412670:route-table/rtb-00dff5ae8ae412397" -> null
      - id               = "rtb-00dff5ae8ae412397" -> null
      - owner_id         = "789248412670" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-040986b406d4985df"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.20.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0d0cc652e00708e07"
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "172.30.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0f32c605654aca470"
            },
        ] -> null
      - tags             = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1b"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - tags_all         = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1b"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - vpc_id           = "vpc-06e902e12267c5529" -> null

      - timeouts {}
    }

  # module.vpc.aws_route_table.private[2] has been deleted
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:789248412670:route-table/rtb-0f87fc96024e79bdd" -> null
      - id               = "rtb-0f87fc96024e79bdd" -> null
      - owner_id         = "789248412670" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0dbd1b2e99257c5d9"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.20.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0d0cc652e00708e07"
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "172.30.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0f32c605654aca470"
            },
        ] -> null
      - tags             = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1c"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - tags_all         = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1c"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - vpc_id           = "vpc-06e902e12267c5529" -> null

      - timeouts {}
    }

  # module.vpc.aws_route_table.public[0] has been deleted
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-1:789248412670:route-table/rtb-047d168fc8aa4c331" -> null
      - id               = "rtb-047d168fc8aa4c331" -> null
      - owner_id         = "789248412670" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-08cfd6d6821a47978"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "10.20.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0d0cc652e00708e07"
            },
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "172.30.0.0/16"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = "pcx-0f32c605654aca470"
            },
        ] -> null
      - tags             = {
          - "Attributes"          = "public"
          - "Name"                = "shiphero-dev2-public"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "public"
        } -> null
      - tags_all         = {
          - "Attributes"          = "public"
          - "Name"                = "shiphero-dev2-public"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "public"
        } -> null
      - vpc_id           = "vpc-06e902e12267c5529" -> null

      - timeouts {}
    }

  # module.vpc.aws_route_table_association.private[0] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-02d0fd3426b87b1cf" -> null
      - route_table_id = "rtb-08606307e01521ce2" -> null
      - subnet_id      = "subnet-031cd0260d383f19f" -> null
    }

  # module.vpc.aws_route_table_association.private[1] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0ebb411d63116487d" -> null
      - route_table_id = "rtb-00dff5ae8ae412397" -> null
      - subnet_id      = "subnet-0e8a975ca98716b75" -> null
    }

  # module.vpc.aws_route_table_association.private[2] has been deleted
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-087890f9b30120e5d" -> null
      - route_table_id = "rtb-0f87fc96024e79bdd" -> null
      - subnet_id      = "subnet-021c42531e7e87883" -> null
    }

  # module.vpc.aws_route_table_association.public[0] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-031e15026f3403be6" -> null
      - route_table_id = "rtb-047d168fc8aa4c331" -> null
      - subnet_id      = "subnet-08053d1f588da1754" -> null
    }

  # module.vpc.aws_route_table_association.public[1] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-032ee20ac868914f2" -> null
      - route_table_id = "rtb-047d168fc8aa4c331" -> null
      - subnet_id      = "subnet-0b9fd484dfb5c510d" -> null
    }

  # module.vpc.aws_route_table_association.public[2] has been deleted
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-03fc8f1e0ceed0a6e" -> null
      - route_table_id = "rtb-047d168fc8aa4c331" -> null
      - subnet_id      = "subnet-090d9da251f5f3471" -> null
    }

  # module.vpc.aws_subnet.private[0] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:789248412670:subnet/subnet-031cd0260d383f19f" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.60.0.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-031cd0260d383f19f" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "789248412670" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1a"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - tags_all                                       = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1a"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - vpc_id                                         = "vpc-06e902e12267c5529" -> null

      - timeouts {}
    }

  # module.vpc.aws_subnet.private[1] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:789248412670:subnet/subnet-0e8a975ca98716b75" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.60.16.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e8a975ca98716b75" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "789248412670" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1b"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - tags_all                                       = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1b"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - vpc_id                                         = "vpc-06e902e12267c5529" -> null

      - timeouts {}
    }

  # module.vpc.aws_subnet.private[2] has been deleted
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:789248412670:subnet/subnet-021c42531e7e87883" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.60.32.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-021c42531e7e87883" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "789248412670" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1c"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - tags_all                                       = {
          - "Attributes"          = "private"
          - "Name"                = "shiphero-dev2-private-use1c"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "private"
        } -> null
      - vpc_id                                         = "vpc-06e902e12267c5529" -> null

      - timeouts {}
    }

  # module.vpc.aws_subnet.public[0] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:789248412670:subnet/subnet-08053d1f588da1754" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.60.96.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-08053d1f588da1754" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "789248412670" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Attributes"          = "public"
          - "Name"                = "shiphero-dev2-public-use1a"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "public"
        } -> null
      - tags_all                                       = {
          - "Attributes"          = "public"
          - "Name"                = "shiphero-dev2-public-use1a"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "public"
        } -> null
      - vpc_id                                         = "vpc-06e902e12267c5529" -> null

      - timeouts {}
    }

  # module.vpc.aws_subnet.public[1] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:789248412670:subnet/subnet-0b9fd484dfb5c510d" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.60.112.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0b9fd484dfb5c510d" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "789248412670" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Attributes"          = "public"
          - "Name"                = "shiphero-dev2-public-use1b"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "public"
        } -> null
      - tags_all                                       = {
          - "Attributes"          = "public"
          - "Name"                = "shiphero-dev2-public-use1b"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "public"
        } -> null
      - vpc_id                                         = "vpc-06e902e12267c5529" -> null

      - timeouts {}
    }

  # module.vpc.aws_subnet.public[2] has been deleted
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:789248412670:subnet/subnet-090d9da251f5f3471" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.60.128.0/20" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-090d9da251f5f3471" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "789248412670" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Attributes"          = "public"
          - "Name"                = "shiphero-dev2-public-use1c"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "public"
        } -> null
      - tags_all                                       = {
          - "Attributes"          = "public"
          - "Name"                = "shiphero-dev2-public-use1c"
          - "Namespace"           = "shiphero"
          - "Stage"               = "dev2"
          - "cpco.io/subnet/type" = "public"
        } -> null
      - vpc_id                                         = "vpc-06e902e12267c5529" -> null

      - timeouts {}
    }

  # module.vpc.aws_vpc.this[0] has been deleted
  - resource "aws_vpc" "this" {
      - arn                              = "arn:aws:ec2:us-east-1:789248412670:vpc/vpc-06e902e12267c5529" -> null
      - cidr_block                       = "10.60.0.0/16" -> null
      - default_network_acl_id           = "acl-050e35b1f8eb6d775" -> null
      - default_route_table_id           = "rtb-047d168fc8aa4c331" -> null
      - default_security_group_id        = "sg-0ea2c2d64cf5c7606" -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-06e902e12267c5529" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-047d168fc8aa4c331" -> null
      - owner_id                         = "789248412670" -> null
        tags                             = {
            "Name"      = "shiphero-dev2"
            "Namespace" = "shiphero"
            "Stage"     = "dev2"
            "Terraform" = "true"
        }
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"      = "shiphero-dev2"
          + "Namespace" = "shiphero"
          + "Stage"     = "dev2"
          + "Terraform" = "true"
        }
      + tags_all = {
          + "Name"      = "shiphero-dev2"
          + "Namespace" = "shiphero"
          + "Stage"     = "dev2"
          + "Terraform" = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1a"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all         = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1a"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1b"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all         = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1b"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1c"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all         = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1c"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Attributes"          = "public"
          + "Name"                = "shiphero-dev2-public"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + tags_all         = {
          + "Attributes"          = "public"
          + "Name"                = "shiphero-dev2-public"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.60.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1a"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all                                       = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1a"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.60.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1b"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all                                       = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1b"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.60.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1c"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + tags_all                                       = {
          + "Attributes"          = "private"
          + "Name"                = "shiphero-dev2-private-us-east-1c"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.60.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"          = "public"
          + "Name"                = "shiphero-dev2-public-us-east-1a"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + tags_all                                       = {
          + "Attributes"          = "public"
          + "Name"                = "shiphero-dev2-public-us-east-1a"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.60.112.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"          = "public"
          + "Name"                = "shiphero-dev2-public-us-east-1b"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + tags_all                                       = {
          + "Attributes"          = "public"
          + "Name"                = "shiphero-dev2-public-us-east-1b"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.60.128.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"          = "public"
          + "Name"                = "shiphero-dev2-public-us-east-1c"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + tags_all                                       = {
          + "Attributes"          = "public"
          + "Name"                = "shiphero-dev2-public-us-east-1c"
          + "Namespace"           = "shiphero"
          + "Stage"               = "dev2"
          + "Terraform"           = "true"
          + "cpco.io/subnet/type" = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.60.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"      = "shiphero-dev2"
          + "Namespace" = "shiphero"
          + "Stage"     = "dev2"
          + "Terraform" = "true"
        }
      + tags_all                             = {
          + "Name"      = "shiphero-dev2"
          + "Namespace" = "shiphero"
          + "Stage"     = "dev2"
          + "Terraform" = "true"
        }
    }

Plan: 19 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @renemontilva, Action: `pull_request`, Working Directory: ``, Workflow: `TF CI/CD Check PR Plan for Dev`*